{
  "module": "synalinks.src.programs.functional",
  "class_name": "Functional",
  "config": {
    "name": "arcagi_task_84551f4c",
    "trainable": true,
    "modules": [
      {
        "module": "synalinks.modules",
        "class_name": "InputModule",
        "config": {
          "schema": {
            "$defs": {
              "ARCAGITask": {
                "additionalProperties": false,
                "description": "Single transformation example",
                "properties": {
                  "input_grid": {
                    "description": "The input grid (list of integer list)",
                    "items": {
                      "items": {
                        "$ref": "#/$defs/Color"
                      },
                      "type": "array"
                    },
                    "title": "Input Grid",
                    "type": "array"
                  },
                  "output_grid": {
                    "description": "The output grid (list of integer list)",
                    "items": {
                      "items": {
                        "$ref": "#/$defs/Color"
                      },
                      "type": "array"
                    },
                    "title": "Output Grid",
                    "type": "array"
                  }
                },
                "required": [
                  "input_grid",
                  "output_grid"
                ],
                "title": "ARCAGITask",
                "type": "object"
              },
              "Color": {
                "description": "ARC-AGI color palette",
                "enum": [
                  0,
                  1,
                  2,
                  3,
                  4,
                  5,
                  6,
                  7,
                  8,
                  9
                ],
                "title": "Color",
                "type": "integer"
              }
            },
            "additionalProperties": false,
            "description": "Input for the ARC-AGI solver",
            "properties": {
              "examples": {
                "description": "A set of transformation examples",
                "items": {
                  "$ref": "#/$defs/ARCAGITask"
                },
                "title": "Examples",
                "type": "array"
              },
              "input_grid": {
                "description": "The input grid (list of integer list)",
                "items": {
                  "items": {
                    "$ref": "#/$defs/Color"
                  },
                  "type": "array"
                },
                "title": "Input Grid",
                "type": "array"
              }
            },
            "required": [
              "examples",
              "input_grid"
            ],
            "title": "ARCAGIInput",
            "type": "object"
          },
          "optional": false,
          "name": "input_module_559",
          "description": "Defines the input data model for a program."
        },
        "registered_name": null,
        "name": "input_module_559",
        "inbound_nodes": []
      },
      {
        "module": "synalinks.modules",
        "class_name": "PythonSynthesis",
        "config": {
          "schema": {
            "$defs": {
              "Color": {
                "description": "ARC-AGI color palette",
                "enum": [
                  0,
                  1,
                  2,
                  3,
                  4,
                  5,
                  6,
                  7,
                  8,
                  9
                ],
                "title": "Color",
                "type": "integer"
              }
            },
            "additionalProperties": false,
            "description": "Output from the ARC-AGI solver",
            "properties": {
              "output_grid": {
                "description": "The output grid (list of integer list)",
                "items": {
                  "items": {
                    "$ref": "#/$defs/Color"
                  },
                  "type": "array"
                },
                "title": "Output Grid",
                "type": "array"
              }
            },
            "required": [
              "output_grid"
            ],
            "title": "ARCAGIOutput",
            "type": "object"
          },
          "python_script": "\ndef transform(inputs):\n    # TODO implement the python function to transform the input grid into the output grid\n    return {\"output_grid\": inputs.get(\"input_grid\")}\n    \nresult = transform(inputs)\n",
          "seed_scripts": [],
          "default_return_value": {
            "output_grid": [
              []
            ]
          },
          "name": "python_synthesis_559",
          "description": "A code Python code transformation on JSON data.",
          "trainable": true
        },
        "registered_name": null,
        "name": "python_synthesis_559",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__symbolic_data_model__",
                "config": {
                  "schema": {
                    "$defs": {
                      "ARCAGITask": {
                        "additionalProperties": false,
                        "description": "Single transformation example",
                        "properties": {
                          "input_grid": {
                            "description": "The input grid (list of integer list)",
                            "items": {
                              "items": {
                                "$ref": "#/$defs/Color"
                              },
                              "type": "array"
                            },
                            "title": "Input Grid",
                            "type": "array"
                          },
                          "output_grid": {
                            "description": "The output grid (list of integer list)",
                            "items": {
                              "items": {
                                "$ref": "#/$defs/Color"
                              },
                              "type": "array"
                            },
                            "title": "Output Grid",
                            "type": "array"
                          }
                        },
                        "required": [
                          "input_grid",
                          "output_grid"
                        ],
                        "title": "ARCAGITask",
                        "type": "object"
                      },
                      "Color": {
                        "description": "ARC-AGI color palette",
                        "enum": [
                          0,
                          1,
                          2,
                          3,
                          4,
                          5,
                          6,
                          7,
                          8,
                          9
                        ],
                        "title": "Color",
                        "type": "integer"
                      }
                    },
                    "additionalProperties": false,
                    "description": "Input for the ARC-AGI solver",
                    "properties": {
                      "examples": {
                        "description": "A set of transformation examples",
                        "items": {
                          "$ref": "#/$defs/ARCAGITask"
                        },
                        "title": "Examples",
                        "type": "array"
                      },
                      "input_grid": {
                        "description": "The input grid (list of integer list)",
                        "items": {
                          "items": {
                            "$ref": "#/$defs/Color"
                          },
                          "type": "array"
                        },
                        "title": "Input Grid",
                        "type": "array"
                      }
                    },
                    "required": [
                      "examples",
                      "input_grid"
                    ],
                    "title": "ARCAGIInput",
                    "type": "object"
                  },
                  "synalinks_history": [
                    "input_module_559",
                    0,
                    0
                  ]
                }
              }
            ],
            "kwargs": {
              "training": false
            }
          }
        ]
      }
    ],
    "input_modules": [
      [
        "input_module_559",
        0,
        0
      ]
    ],
    "output_modules": [
      [
        "python_synthesis_559",
        0,
        0
      ]
    ]
  },
  "registered_name": "Functional",
  "compile_config": {
    "optimizer": {
      "module": "synalinks.optimizers",
      "class_name": "OMEGA",
      "config": {
        "k_nearest_fitter": 5,
        "mutation_temperature": 1.0,
        "crossover_temperature": 1.0,
        "few_shot_learning": false,
        "nb_min_examples": 1,
        "nb_max_examples": 3,
        "sampling_temperature": 1.0,
        "merging_rate": 0.02,
        "population_size": 10,
        "name": "omega_559",
        "description": "OMEGA: OptiMizEr as Genetic Algorithm - A genetic optimizer with dominated novelty search.",
        "language_model": {
          "module": "synalinks",
          "class_name": "LanguageModel",
          "config": {
            "model": "xai/grok-code-fast-1",
            "api_base": null,
            "timeout": 600,
            "retry": 5,
            "caching": false
          },
          "registered_name": null
        },
        "embedding_model": {
          "module": "synalinks",
          "class_name": "EmbeddingModel",
          "config": {
            "model": "ollama/mxbai-embed-large",
            "api_base": "http://localhost:11434",
            "retry": 5
          },
          "registered_name": null
        }
      },
      "registered_name": null
    },
    "reward": {
      "module": "synalinks.rewards",
      "class_name": "RewardFunctionWrapper",
      "config": {
        "name": "reward_function_wrapper_559",
        "reduction": "mean",
        "in_mask": [
          "output_grid"
        ],
        "out_mask": null,
        "fn": {
          "module": "builtins",
          "class_name": "function",
          "config": "Custom>grid_similarity",
          "registered_name": "function"
        }
      },
      "registered_name": null
    },
    "reward_weights": null,
    "metrics": [
      {
        "module": "synalinks.metrics",
        "class_name": "MeanMetricWrapper",
        "config": {
          "in_mask": [
            "output_grid"
          ],
          "out_mask": null,
          "name": "exact_match",
          "fn": {
            "module": "builtins",
            "class_name": "function",
            "config": "exact_match",
            "registered_name": "function"
          }
        },
        "registered_name": null
      }
    ],
    "run_eagerly": false,
    "steps_per_execution": 1
  },
  "variables": {
    "trainable_variables": {
      "python_synthesis_559": {
        "state_python_synthesis_559": {
          "examples": [],
          "current_predictions": [],
          "predictions": [
            {
              "inputs": {
                "examples": [
                  {
                    "input_grid": [
                      [
                        1,
                        0,
                        0,
                        2,
                        0,
                        0,
                        2,
                        0,
                        0,
                        0,
                        2,
                        0,
                        0,
                        2,
                        0,
                        0
                      ],
                      [
                        1,
                        0,
                        0,
                        2,
                        0,
                        0,
                        2,
                        0,
                        0,
                        0,
                        2,
                        0,
                        0,
                        2,
                        0,
                        0
                      ],
                      [
                        1,
                        0,
                        0,
                        2,
                        0,
                        0,
                        2,
                        0,
                        0,
                        0,
                        2,
                        0,
                        0,
                        2,
                        0,
                        0
                      ]
                    ],
                    "output_grid": [
                      [
                        0,
                        0,
                        0,
                        0,
                        0,
                        0,
                        0,
                        0,
                        0,
                        0,
                        2,
                        0,
                        0,
                        2,
                        0,
                        0
                      ],
                      [
                        0,
                        0,
                        0,
                        0,
                        0,
                        0,
                        0,
                        0,
                        0,
                        0,
                        2,
                        0,
                        0,
                        2,
                        0,
                        0
                      ],
                      [
                        1,
                        1,
                        1,
                        2,
                        2,
                        2,
                        2,
                        2,
                        2,
                        0,
                        2,
                        0,
                        0,
                        2,
                        0,
                        0
                      ]
                    ]
                  },
                  {
                    "input_grid": [
                      [
                        1,
                        0,
                        0,
                        0,
                        2,
                        0,
                        0,
                        0,
                        1,
                        0,
                        0,
                        2,
                        0,
                        0,
                        0,
                        0
                      ],
                      [
                        1,
                        0,
                        0,
                        0,
                        2,
                        0,
                        0,
                        0,
                        1,
                        0,
                        0,
                        2,
                        0,
                        0,
                        0,
                        0
                      ],
                      [
                        1,
                        0,
                        0,
                        0,
                        2,
                        0,
                        0,
                        0,
                        1,
                        0,
                        0,
                        2,
                        0,
                        0,
                        0,
                        0
                      ]
                    ],
                    "output_grid": [
                      [
                        0,
                        0,
                        0,
                        0,
                        2,
                        0,
                        0,
                        0,
                        0,
                        0,
                        0,
                        0,
                        0,
                        0,
                        0,
                        0
                      ],
                      [
                        0,
                        0,
                        0,
                        0,
                        2,
                        0,
                        0,
                        0,
                        0,
                        0,
                        0,
                        0,
                        0,
                        0,
                        0,
                        0
                      ],
                      [
                        1,
                        1,
                        1,
                        0,
                        2,
                        0,
                        0,
                        0,
                        1,
                        1,
                        1,
                        2,
                        2,
                        2,
                        0,
                        0
                      ]
                    ]
                  }
                ],
                "input_grid": [
                  [
                    1,
                    0,
                    0,
                    2,
                    0,
                    0,
                    0
                  ],
                  [
                    1,
                    0,
                    0,
                    2,
                    0,
                    0,
                    0
                  ],
                  [
                    1,
                    0,
                    0,
                    2,
                    0,
                    0,
                    0
                  ]
                ]
              },
              "outputs": {
                "output_grid": [
                  [
                    0,
                    0,
                    0,
                    0,
                    0,
                    0,
                    0
                  ],
                  [
                    0,
                    0,
                    0,
                    0,
                    0,
                    0,
                    0
                  ],
                  [
                    1,
                    1,
                    1,
                    2,
                    2,
                    2,
                    0
                  ]
                ],
                "stdout": "",
                "stderr": ""
              },
              "reward": 1.0
            },
            {
              "inputs": {
                "examples": [
                  {
                    "input_grid": [
                      [
                        1,
                        0,
                        0,
                        0,
                        2,
                        0,
                        0,
                        0,
                        1,
                        0,
                        0,
                        2,
                        0,
                        0,
                        0,
                        0
                      ],
                      [
                        1,
                        0,
                        0,
                        0,
                        2,
                        0,
                        0,
                        0,
                        1,
                        0,
                        0,
                        2,
                        0,
                        0,
                        0,
                        0
                      ],
                      [
                        1,
                        0,
                        0,
                        0,
                        2,
                        0,
                        0,
                        0,
                        1,
                        0,
                        0,
                        2,
                        0,
                        0,
                        0,
                        0
                      ]
                    ],
                    "output_grid": [
                      [
                        0,
                        0,
                        0,
                        0,
                        2,
                        0,
                        0,
                        0,
                        0,
                        0,
                        0,
                        0,
                        0,
                        0,
                        0,
                        0
                      ],
                      [
                        0,
                        0,
                        0,
                        0,
                        2,
                        0,
                        0,
                        0,
                        0,
                        0,
                        0,
                        0,
                        0,
                        0,
                        0,
                        0
                      ],
                      [
                        1,
                        1,
                        1,
                        0,
                        2,
                        0,
                        0,
                        0,
                        1,
                        1,
                        1,
                        2,
                        2,
                        2,
                        0,
                        0
                      ]
                    ]
                  },
                  {
                    "input_grid": [
                      [
                        1,
                        0,
                        0,
                        2,
                        0,
                        0,
                        0
                      ],
                      [
                        1,
                        0,
                        0,
                        2,
                        0,
                        0,
                        0
                      ],
                      [
                        1,
                        0,
                        0,
                        2,
                        0,
                        0,
                        0
                      ]
                    ],
                    "output_grid": [
                      [
                        0,
                        0,
                        0,
                        0,
                        0,
                        0,
                        0
                      ],
                      [
                        0,
                        0,
                        0,
                        0,
                        0,
                        0,
                        0
                      ],
                      [
                        1,
                        1,
                        1,
                        2,
                        2,
                        2,
                        0
                      ]
                    ]
                  }
                ],
                "input_grid": [
                  [
                    1,
                    0,
                    0,
                    2,
                    0,
                    0,
                    2,
                    0,
                    0,
                    0,
                    2,
                    0,
                    0,
                    2,
                    0,
                    0
                  ],
                  [
                    1,
                    0,
                    0,
                    2,
                    0,
                    0,
                    2,
                    0,
                    0,
                    0,
                    2,
                    0,
                    0,
                    2,
                    0,
                    0
                  ],
                  [
                    1,
                    0,
                    0,
                    2,
                    0,
                    0,
                    2,
                    0,
                    0,
                    0,
                    2,
                    0,
                    0,
                    2,
                    0,
                    0
                  ]
                ]
              },
              "outputs": {
                "output_grid": [
                  [
                    0,
                    0,
                    0,
                    0,
                    0,
                    0,
                    0,
                    0,
                    0,
                    0,
                    2,
                    0,
                    0,
                    2,
                    0,
                    0
                  ],
                  [
                    0,
                    0,
                    0,
                    0,
                    0,
                    0,
                    0,
                    0,
                    0,
                    0,
                    2,
                    0,
                    0,
                    2,
                    0,
                    0
                  ],
                  [
                    1,
                    1,
                    1,
                    2,
                    2,
                    2,
                    2,
                    2,
                    2,
                    0,
                    2,
                    0,
                    0,
                    2,
                    0,
                    0
                  ]
                ],
                "stdout": "",
                "stderr": ""
              },
              "reward": 1.0
            },
            {
              "inputs": {
                "examples": [
                  {
                    "input_grid": [
                      [
                        1,
                        0,
                        0,
                        2,
                        0,
                        0,
                        2,
                        0,
                        0,
                        0,
                        2,
                        0,
                        0,
                        2,
                        0,
                        0
                      ],
                      [
                        1,
                        0,
                        0,
                        2,
                        0,
                        0,
                        2,
                        0,
                        0,
                        0,
                        2,
                        0,
                        0,
                        2,
                        0,
                        0
                      ],
                      [
                        1,
                        0,
                        0,
                        2,
                        0,
                        0,
                        2,
                        0,
                        0,
                        0,
                        2,
                        0,
                        0,
                        2,
                        0,
                        0
                      ]
                    ],
                    "output_grid": [
                      [
                        0,
                        0,
                        0,
                        0,
                        0,
                        0,
                        0,
                        0,
                        0,
                        0,
                        2,
                        0,
                        0,
                        2,
                        0,
                        0
                      ],
                      [
                        0,
                        0,
                        0,
                        0,
                        0,
                        0,
                        0,
                        0,
                        0,
                        0,
                        2,
                        0,
                        0,
                        2,
                        0,
                        0
                      ],
                      [
                        1,
                        1,
                        1,
                        2,
                        2,
                        2,
                        2,
                        2,
                        2,
                        0,
                        2,
                        0,
                        0,
                        2,
                        0,
                        0
                      ]
                    ]
                  },
                  {
                    "input_grid": [
                      [
                        1,
                        0,
                        0,
                        2,
                        0,
                        0,
                        0
                      ],
                      [
                        1,
                        0,
                        0,
                        2,
                        0,
                        0,
                        0
                      ],
                      [
                        1,
                        0,
                        0,
                        2,
                        0,
                        0,
                        0
                      ]
                    ],
                    "output_grid": [
                      [
                        0,
                        0,
                        0,
                        0,
                        0,
                        0,
                        0
                      ],
                      [
                        0,
                        0,
                        0,
                        0,
                        0,
                        0,
                        0
                      ],
                      [
                        1,
                        1,
                        1,
                        2,
                        2,
                        2,
                        0
                      ]
                    ]
                  }
                ],
                "input_grid": [
                  [
                    1,
                    0,
                    0,
                    0,
                    2,
                    0,
                    0,
                    0,
                    1,
                    0,
                    0,
                    2,
                    0,
                    0,
                    0,
                    0
                  ],
                  [
                    1,
                    0,
                    0,
                    0,
                    2,
                    0,
                    0,
                    0,
                    1,
                    0,
                    0,
                    2,
                    0,
                    0,
                    0,
                    0
                  ],
                  [
                    1,
                    0,
                    0,
                    0,
                    2,
                    0,
                    0,
                    0,
                    1,
                    0,
                    0,
                    2,
                    0,
                    0,
                    0,
                    0
                  ]
                ]
              },
              "outputs": {
                "output_grid": [
                  [
                    0,
                    0,
                    0,
                    0,
                    2,
                    0,
                    0,
                    0,
                    0,
                    0,
                    0,
                    0,
                    0,
                    0,
                    0,
                    0
                  ],
                  [
                    0,
                    0,
                    0,
                    0,
                    2,
                    0,
                    0,
                    0,
                    0,
                    0,
                    0,
                    0,
                    0,
                    0,
                    0,
                    0
                  ],
                  [
                    1,
                    1,
                    1,
                    0,
                    2,
                    0,
                    0,
                    0,
                    1,
                    1,
                    1,
                    2,
                    2,
                    2,
                    0,
                    0
                  ]
                ],
                "stdout": "",
                "stderr": ""
              },
              "reward": 1.0
            }
          ],
          "seed_candidates": [
            {
              "python_script": "\ndef transform(inputs):\n    if 'input_grid' not in inputs:\n        raise ValueError(\"Input must contain 'input_grid'\")\n    grid = inputs['input_grid']\n    if not grid or not grid[0]:\n        return {\"output_grid\": grid}\n    rows = len(grid)\n    cols = len(grid[0])\n    # Ensure all rows have the same length\n    if any(len(row) != cols for row in grid):\n        raise ValueError(\"All rows must have the same number of columns\")\n    output = [row[:] for row in grid]\n    positions = []\n    # Collect positions of key numbers to transform\n    for r in range(rows):\n        for c in range(cols):\n            if grid[r][c] in [1, 4, 7]:\n                positions.append((r, c, grid[r][c]))\n    # Additionally, detect horizontal bars of 8's of length >= 9 and add their centers\n    for r in range(rows):\n        i = 0\n        while i < cols:\n            if grid[r][i] == 8:\n                start = i\n                while i < cols and grid[r][i] == 8:\n                    i += 1\n                end = i - 1\n                length = end - start + 1\n                if length >= 9:\n                    center = (start + end) // 2\n                    positions.append((r, center, 8))\n            else:\n                i += 1\n    for r0, c0, num in positions:\n        output[r0][c0] = 0  # Clear the original position\n        # Fill in the patterned areas below the position\n        r_offsets = [1, 2, 3, 4]  # Relative row offsets to fill\n        for rel_r in r_offsets:\n            r = r0 + rel_r\n            if r >= rows:\n                continue  # Skip if beyond grid\n            if rel_r == 1:\n                dc_list = [2, 3]\n            elif rel_r in [2, 3]:\n                dc_list = [1, 2, 3, 4]\n            elif rel_r == 4:\n                dc_list = [2, 3]\n            for dc in dc_list:\n                c = c0 + dc\n                if 0 <= c < cols and output[r][c] == 0:  # Only fill empty cells\n                    output[r][c] = num\n    return {\"output_grid\": output}\n\nresult = transform(inputs)\n"
            },
            {
              "python_script": "def transform(inputs):\n    import copy\n    grid = copy.deepcopy(inputs['input_grid'])\n    rows = len(grid)\n    cols = len(grid[0])\n    colors = set()\n    for r in range(rows):\n        for c in range(cols):\n            if grid[r][c] != 0:\n                colors.add(grid[r][c])\n    \n    for color in colors:\n        min_r, max_r, min_c, max_c = rows, -1, cols, -1\n        for r in range(rows):\n            for c in range(cols):\n                if grid[r][c] == color:\n                    min_r = min(min_r, r)\n                    max_r = max(max_r, r)\n                    min_c = min(min_c, c)\n                    max_c = max(max_c, c)\n        # Now apply the transformation\n        for r in range(min_r, max_r + 1):\n            if r == min_r or r == max_r:\n                # Keep full, but ensure only within min_c to max_c if needed, but assume it is\n                pass\n            else:\n                # Hollow: keep min_c and max_c, set middle to 0\n                for c in range(min_c + 1, max_c):\n                    grid[r][c] = 0\n                # Keep grid[r][min_c] and grid[r][max_c] as color, but already are\n    return {'output_grid': grid}\n\nresult = transform(inputs)"
            },
            {
              "python_script": "def transform(inputs):\n    input_grid = inputs.get('input_grid', [])\n    if not input_grid or not all(row for row in input_grid):\n        return {'output_grid': input_grid}\n    rows = len(input_grid)\n    cols = len(input_grid[0]) if rows > 0 else 0\n    if cols == 0 or not all(len(row) == cols for row in input_grid):\n        return {'output_grid': input_grid}\n    \n    max_area = 0\n    max_rect = None\n    for r1 in range(rows):\n        for r2 in range(r1, rows):\n            for c1 in range(cols):\n                for c2 in range(c1, cols):\n                    val = input_grid[r1][c1]\n                    if val == 0:\n                        continue\n                    is_solid = all(input_grid[r][c] == val for r in range(r1, r2+1) for c in range(c1, c2+1))\n                    if is_solid:\n                        area = (r2 - r1 + 1) * (c2 - c1 + 1)\n                        if area > max_area:\n                            max_area = area\n                            max_rect = (r1, r2, c1, c2, val)\n    \n    output_grid = [[0 for _ in range(cols)] for _ in range(rows)]\n    if max_rect:\n        r1, r2, c1, c2, val = max_rect\n        for r in range(r1, r2 + 1):\n            for c in range(c1, c2 + 1):\n                output_grid[r][c] = val\n    \n    return {'output_grid': output_grid}\n\nresult = transform(inputs)"
            },
            {
              "examples": [],
              "python_script": "\ndef transform(inputs):\n    # TODO implement the python function to transform the input grid into the output grid\n    return {\"output_grid\": inputs.get(\"input_grid\")}\n    \nresult = transform(inputs)\n"
            }
          ],
          "candidates": [
            {
              "python_script": "def transform(inputs):\n    input_grid = inputs.get('input_grid', [])\n    if not input_grid or not all(row for row in input_grid):\n        return {'output_grid': input_grid}\n    num_rows = len(input_grid)\n    num_cols = len(input_grid[0]) if input_grid else 0\n    if num_cols == 0:\n        return {'output_grid': input_grid}\n    # Collect positions from all rows, assuming symmetry but allow flexibility\n    all_positions_1 = set()\n    all_positions_2 = set()\n    for row in input_grid:\n        all_positions_1.update([i for i, v in enumerate(row) if v == 1])\n        all_positions_2.update([i for i, v in enumerate(row) if v == 2])\n    positions_1 = sorted(all_positions_1)\n    positions_2 = sorted(all_positions_2)\n    len_2 = len(positions_2)\n    if len_2 == 1:\n        kept_indices = []\n    elif len_2 == 2:\n        kept_indices = [0]\n    elif len_2 == 4:\n        kept_indices = [2, 3]\n    else:\n        kept_indices = []\n    kept_positions = [positions_2[i] for i in kept_indices]\n    output_grid = [[0 for _ in range(num_cols)] for _ in range(num_rows)]\n    # Set top rows\n    for r in range(num_rows - 1):\n        for pos in kept_positions:\n            if pos < num_cols:\n                output_grid[r][pos] = 2\n    # Set bottom row\n    bottom_r = num_rows - 1\n    for pos in positions_1:\n        for j in range(num_rows):\n            if pos + j < num_cols:\n                output_grid[bottom_r][pos + j] = 1\n    for i, pos in enumerate(positions_2):\n        if i in kept_indices:\n            if pos < num_cols:\n                output_grid[bottom_r][pos] = 2\n        else:\n            for j in range(num_rows):\n                if pos + j < num_cols:\n                    output_grid[bottom_r][pos + j] = 2\n    return {'output_grid': output_grid}\n\nresult = transform(inputs)",
              "examples": [],
              "reward": 0.9222222566604614
            },
            {
              "python_script": "def transform(inputs):\n    grid = inputs.get(\"input_grid\")\n    if not grid or len(grid) == 0:\n        return {\"output_grid\": grid}\n    height = len(grid)\n    width = len(grid[0])\n    if height == 0 or width == 0:\n        return {\"output_grid\": grid}\n    bottom = grid[-1]\n    new_bottom = [0] * width\n    top_positions = set()\n    \n    def fill_group(start, length, value):\n        for j in range(length):\n            if start + j < width:\n                new_bottom[start + j] = value\n    \n    i = 0\n    filled_2 = False\n    while i < width:\n        if bottom[i] == 1:\n            fill_group(i, 3, 1)\n            filled_2 = False\n            i += 3\n        elif bottom[i] == 2:\n            new_bottom[i] = 2\n            if not filled_2:\n                has_1_after = 1 in bottom[i+1:]\n                if i + 3 < width and bottom[i + 3] == 2:\n                    fill_group(i, 6, 2)\n                    i += 6\n                elif not has_1_after:\n                    fill_group(i, 3, 2)\n                    i += 3\n                else:\n                    top_positions.add(i)\n                    i += 1\n            else:\n                top_positions.add(i)\n                i += 1\n            filled_2 = True\n        else:\n            i += 1\n    \n    # Build output grid\n    output_grid = []\n    for row_idx in range(height):\n        if row_idx < height - 1:\n            row = [0] * width\n            for pos in top_positions:\n                if pos < width:\n                    row[pos] = 2\n            output_grid.append(row)\n        else:\n            output_grid.append(new_bottom)\n    return {\"output_grid\": output_grid}\n\nresult = transform(inputs)",
              "examples": [],
              "reward": 0.894444465637207
            },
            {
              "python_script": "def transform(inputs):\n    grid = inputs.get(\"input_grid\")\n    if not grid or len(grid) != 3:\n        return {\"output_grid\": grid}\n    height = len(grid)\n    width = len(grid[0])\n    bottom = grid[-1]\n    new_bottom = [0] * width\n    top_positions = []\n    \n    # Find positions of 1's and handle their horizontal fill\n    ones_positions = [i for i, val in enumerate(bottom) if val == 1]\n    for i in ones_positions:\n        for j in range(3):\n            if i + j < width:\n                new_bottom[i + j] = 1\n    \n    # Find positions of 2's\n    twos_positions = [i for i, val in enumerate(bottom) if val == 2]\n    \n    # Identify groups of consecutive 2's\n    if twos_positions:\n        groups = []\n        start = twos_positions[0]\n        prev = start\n        for curr in twos_positions[1:]:\n            if curr != prev + 1:\n                groups.append((start, prev))\n                start = curr\n            prev = curr\n        groups.append((start, prev))\n        \n        for start, end in groups:\n            length = end - start + 1\n            for j in range(length * 2):  # Fill double the length or up to width\n                if start + j < width:\n                    new_bottom[start + j] = 2\n            # If single 2, add to top_positions if there are 1's after\n            if length == 1 and any(bottom[i] == 1 for i in range(end + 1, width)):\n                top_positions.append(start)\n    \n    # Build output grid\n    output_grid = [\n        [0] * width for _ in range(height - 1)\n    ] + [new_bottom]\n    for row in output_grid[:-1]:\n        for pos in top_positions:\n            row[pos] = 2\n    \n    return {\"output_grid\": output_grid}\n\nresult = transform(inputs)",
              "examples": [],
              "reward": 0.8703703880310059
            }
          ],
          "best_candidates": [
            {
              "python_script": "def transform(inputs):\n    input_grid = inputs.get('input_grid', [])\n    if not input_grid or not all(row for row in input_grid):\n        return {'output_grid': input_grid}\n    num_rows = len(input_grid)\n    num_cols = len(input_grid[0]) if input_grid else 0\n    if num_cols == 0:\n        return {'output_grid': input_grid}\n    # Collect positions from all rows, assuming symmetry but allow flexibility\n    all_positions_1 = set()\n    all_positions_2 = set()\n    for row in input_grid:\n        all_positions_1.update([i for i, v in enumerate(row) if v == 1])\n        all_positions_2.update([i for i, v in enumerate(row) if v == 2])\n    positions_1 = sorted(all_positions_1)\n    positions_2 = sorted(all_positions_2)\n    len_2 = len(positions_2)\n    if len_2 == 1:\n        kept_indices = []\n    elif len_2 == 2:\n        kept_indices = [0]\n    elif len_2 == 4:\n        kept_indices = [2, 3]\n    else:\n        kept_indices = []\n    kept_positions = [positions_2[i] for i in kept_indices]\n    output_grid = [[0 for _ in range(num_cols)] for _ in range(num_rows)]\n    # Set top rows\n    for r in range(num_rows - 1):\n        for pos in kept_positions:\n            if pos < num_cols:\n                output_grid[r][pos] = 2\n    # Set bottom row\n    bottom_r = num_rows - 1\n    for pos in positions_1:\n        for j in range(num_rows):\n            if pos + j < num_cols:\n                output_grid[bottom_r][pos + j] = 1\n    for i, pos in enumerate(positions_2):\n        if i in kept_indices:\n            if pos < num_cols:\n                output_grid[bottom_r][pos] = 2\n        else:\n            for j in range(num_rows):\n                if pos + j < num_cols:\n                    output_grid[bottom_r][pos + j] = 2\n    return {'output_grid': output_grid}\n\nresult = transform(inputs)",
              "examples": [],
              "reward": 0.9222222566604614
            },
            {
              "python_script": "def transform(inputs):\n    input_grid = inputs.get('input_grid', [])\n    if not input_grid or not all(row for row in input_grid):\n        return {'output_grid': input_grid}\n    num_rows = len(input_grid)\n    num_cols = len(input_grid[0])\n    if num_cols == 0:\n        return {'output_grid': input_grid}\n    # Assume all rows are identical\n    row = input_grid[0]\n    positions_1 = [i for i, v in enumerate(row) if v == 1]\n    positions_2 = [i for i, v in enumerate(row) if v == 2]\n    len_2 = len(positions_2)\n    if len_2 == 1:\n        kept_indices = []\n    elif len_2 == 2:\n        kept_indices = [0]\n    elif len_2 == 4:\n        kept_indices = [2, 3]\n    else:\n        kept_indices = []\n    kept_positions = [positions_2[i] for i in kept_indices]\n    output_grid = [[0 for _ in range(num_cols)] for _ in range(num_rows)]\n    # Set top rows\n    for r in range(num_rows - 1):\n        for pos in kept_positions:\n            output_grid[r][pos] = 2\n    # Set bottom row\n    bottom_r = num_rows - 1\n    for pos in positions_1:\n        for j in range(num_rows):\n            if pos + j < num_cols:\n                output_grid[bottom_r][pos + j] = 1\n    for i, pos in enumerate(positions_2):\n        if i in kept_indices:\n            output_grid[bottom_r][pos] = 2\n        else:\n            for j in range(num_rows):\n                if pos + j < num_cols:\n                    output_grid[bottom_r][pos + j] = 2\n    return {'output_grid': output_grid}\n\nresult = transform(inputs)",
              "examples": [],
              "reward": 0.9037036895751953
            },
            {
